lxyppc/lxyppc-oled/trunk/ lxyppc-oled/STM32/oleddrv/src/main.c
  Clock_DrawFace(GetMaxY()>>1,GetMaxY()>>1,GetMaxY()>>1);
  //Line(counter,0,GetMaxX()-1-counter,GetMaxY()-1);
  u32 lastM = minute;
  while(1){
    if(minute != lastM){
      lastM = minute;
      char buf[] = {minute/10+'0',minute%10+'0',0};
      TextOut(&dev,80,20,buf,0xff);
      if(encCount<0){
        encCount = -encCount;
        char buf[] = {'-',encCount/10+'0',encCount%10+'0',0};
        TextOut(&dev,100,20,buf,0xff);
      }else{
        char buf[] = {'+',encCount/10+'0',encCount%10+'0',0};
        TextOut(&dev,100,20,buf,0xff);
      }
    }
    if(Enc_IsKeyDown()){
      if(SSD1303_IsOn()){
        SSD1303_TurnOff();
      }else{
        SSD1303_TurnOn();
      }
      char buf[] = {minute/10+'0',minute%10+'0',0};
      TextOut(&dev,80,40,buf,0xff);
    }
    char buf[64];
    if(ReadUsbData(buf,64) == LDR_SUCCESS){
      if(buf[1] == 0xAA){
        RTC_SetCounter(*(u32*)(buf+4));
        RTC_WaitForLastTask();
      }
    }
    if(TimeDisplay){
      CheckConnection();
      vu16 ccr1 = TIM3->CCR1;
      Pos_t x = 64;
      Pos_t y = 16;
      TimeDisplay = 0;
      u32 TimeVar = RTC_GetCounter();
      u32 THH = 0, TMM = 0, TSS = 0;
      /* Compute  hours */
      THH = TimeVar / 3600;
      /* Compute minutes */
      TMM = (TimeVar % 3600) / 60;
      /* Compute seconds */
      TSS = (TimeVar % 3600) % 60;
      char tBuf[64] = {1};
      //x = TextOut(&dev,x,y,tBuf+1,0xff);
      Clock_UpdateTime(THH,TMM,TSS);
      time_t now = (time_t)TimeVar;
      char* p = ctime(&now);
      for(u32 i=0;i<26;){
        i++;
        tBuf[i] = *p++;
      }
      TextOut_HighLight(&dev,x,y,tBuf+12,8);
      TextOut(&dev,x,y+16,tBuf+5,6);
      TextOut(&dev,x,y+32,tBuf+21,4);
      TextOut(&dev,x+32,y+32,tBuf+20,1);
      TextOut_HighLight(&dev,x+40,y+32,tBuf+1,3);
      if(0){
        u32 res = ADCResult.ADBat;
        res = res * 328 * 136 / (4096*100);
//        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
//        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],0};
        
        char ADBuf[] = {'B', 'a', 't', HexTable[(res/100)%10], '.', 
        HexTable[(res/10)%10], HexTable[res%10],'V', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      if(0){
        u16 res = ADCResult.ADX;
        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],
        ' ', IsPGOOD() ? 'P' : 'X', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      if(0){
        u16 res = ADCResult.ADY;
        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],
        ' ', IsCHG() ? 'C' : 'X', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      
      static unsigned char icoY = 0;
      //icoY++;
      //if(icoY==64)icoY=0;
      if(IsCHG()){
        DrawIcon(104,icoY,ICON_ID_CHARGE);
      }else if(IsPGOOD()){
        DrawIcon(104,icoY,ICON_ID_POWER);
      }else{
        DrawIcon(104,0,ICON_ID_BATTARY);
        // Battary check
        // Full charge is 4.2V, lower power is 3.3V
        // Vref = 3.28V
        // 10K/13.6K
        // 4.2*10/13.6/3.28*4096 = 3875
        // 3.3*10/13.6/3.28*4096 = 3030
        u32 res = ADCResult.ADBat;
        if(res > 3835){
          res = 800;
        }else if(res < 3030){
          res = 0;
        }else{
          res -= 3030;
        }
        res = 16*res/800;
        res += 106;
        SetColor(BLACK);
        SetLineThickness(NORMAL_LINE);
        Bar(res,2,121,7);
      }
      
      WaitAndSendUsbData(tBuf,64,1);
      //ToggleLED();
    }
  }
}

/*******************************************************************************
* Function Name  : InitialSystem
* Description    : Initialize the system
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialSystem()
{
  GPIO_AFIODeInit();
  GPIO_DeInit(GPIOB);
  /* The bootloader has already initialize the GPIOA*/
  //GPIO_DeInit(GPIOA);
  GPIO_DeInit(GPIOD);
  
  /* NVIC configuration */
  NVIC_Configuration();
  
  /* Initialize GPIO */
  InitialIO();
  
  /* Initialize ADC */
  InitialADC();
  
  /* Initializer system colck */
  RCC_DeInit();
  CheckConnection();
  
  /* Initialize the SSD1303 related IO */
  SSD1303_IO_Configuration();
  
  /* Initialize the SSD1303 */
  SSD1303_Init();
  
  /* Initialize the SSD1303 controller,
     which is simulated by STM32 DMA and systick*/
  SSD1303_Controller_Init();
  
  /* Initialize the RTC peripheral */
  RTC_Configuration();
  
  /* Initial graph lib*/
  InitGraph();
  
  /* Initial encoder interface*/
  Enc_Init();
}

/*******************************************************************************
* Function Name  : InitialADC
* Description    : Initial the ADC for voltage measure
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialADC(void)
{
  ADC_InitTypeDef ADC_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  DMA_InitTypeDef  DMA_InitStructure;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA
                       | RCC_APB2Periph_GPIOB
                       | RCC_APB2Periph_ADC1
                       | RCC_APB2Periph_ADC2,   ENABLE);
  
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
  
  /* Configure PC.0(ADC Channel1, Channel2, )
   as analog input -----------------------------------------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
