lxyppc/lxyppc-oled/trunk/ lxyppc-oled/STM32/oleddrv/src/main.c
  RCC_ADCCLKConfig(RCC_PCLK2_Div6); /// 12MHz for ADC clock
  
  /* Here we config the ADC1 and ADC2  in regular simultaneous mode
     They are trigerred by TIM3 TRGO signal
    The result will stored in ADC1's DR,
  */
  ADC_DeInit(ADC1);
  ADC_DeInit(ADC2);
  
  ADC_InitStructure.ADC_Mode = ADC_Mode_RegSimult;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = 
    ADC_ExternalTrigConv_None;
    //ADC_ExternalTrigConv_T3_TRGO;
    //ADC_ExternalTrigConv_T2_CC2;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 2;
  ADC_Init(ADC1, &ADC_InitStructure);
  ADC_Init(ADC2, &ADC_InitStructure);
  
  ADC_RegularChannelConfig(ADC1, AD_CH_BAT, 1, ADC_SampleTime_55Cycles5);
  ADC_RegularChannelConfig(ADC2, AD_CH_X, 1, ADC_SampleTime_55Cycles5);
  ADC_RegularChannelConfig(ADC1, AD_CH_Y, 2, ADC_SampleTime_55Cycles5);
  ADC_RegularChannelConfig(ADC2, AD_CH_Z, 2, ADC_SampleTime_55Cycles5);
  
  /* Initialize the ADC DMA channel */
  ADC_DMACmd(ADC1,ENABLE);
  DMA_DeInit(DMA_ADC);
  DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&ADC1->DR);
  DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&ADCResult;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = 2;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;//DMA_Priority_Low DMA_Priority_VeryHigh;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA_ADC, &DMA_InitStructure);
//  NVIC_InitStructure.NVIC_IRQChannel = GetDMAIrqChannel(AD_DMA_Channel);
//  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
//  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//  NVIC_Init(&NVIC_InitStructure);
//  DMA_ITConfig(AD_DMA_Channel, DMA_IT_TC, ENABLE);
  DMA_Cmd(DMA_ADC, ENABLE);
  
  
  //ADC_ExternalTrigConvCmd(ADC1, ENABLE);
  ADC_ExternalTrigConvCmd(ADC2, ENABLE);
  ADC_Cmd(ADC1, ENABLE);
  ADC_Cmd(ADC2, ENABLE);
  
  ADC_ResetCalibration(ADC1);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));
  
  
  ADC_ResetCalibration(ADC2);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC2));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC2);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC2));
}

/*******************************************************************************
* Function Name  : InitialIO
* Description    : Initial the GPIOs
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialIO(void)
{
#ifdef  DEBUG_BOARD
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOD, ENABLE);
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
#else
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
  
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
  
  // PA8 is the led 
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  // PB4 for PGOOD signal, PB5 for CHG signal
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  // PB8 for GSel 2, PB9 for GSel2, PB11 for MMA Sleep
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  GSel1_Low();
  GSel2_Low();
  LED_OFF();
  MMA_WAKEUP();
#endif
}

/*******************************************************************************
* Function Name  : SysTickHandler
* Description    : This function handles SysTick Handler.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
#define   SCROLL_THRESHOLD      4
void SysTickHandler(void)
{
  Msg msg;
  static s16 lastEncCnt = 0;
  encCount = Enc_GetCount();
  if((lastEncCnt ^ encCount) & 0x8000 ){
    lastEncCnt = encCount;
  }
  lastEncCnt += encCount;
  if(lastEncCnt>SCROLL_THRESHOLD){
    msg.param = (void*)((s32)encCount);
    msg.message = MSG_SCROLL;
    PostMessage(&msg);
    lastEncCnt -= SCROLL_THRESHOLD;
  }else if(lastEncCnt<-SCROLL_THRESHOLD){
    msg.param = (void*)((s32)encCount);
    msg.message = MSG_SCROLL;
    PostMessage(&msg);
    lastEncCnt += SCROLL_THRESHOLD;
  }
  static u32 keyDown = 0;
  if(Is_Enc_Key_Down()){
    if(keyDown){
      msg.param = 0;
      msg.message = MSG_KEY_DOWN;
      PostMessage(&msg);
    }
    keyDown++;
  }else{
    if(keyDown > 2){
      msg.param = 0;
      msg.message = MSG_KEY_UP;
      PostMessage(&msg);
    }
    keyDown = 0;
  }
  
//  if(encCount>0){
//    minute++;
//    if(minute>=60)minute = 0;
//  }else if(encCount<0){
//    if(minute){
//      minute--;
//    }else{
//      minute = 59;
//    }
//  }
  StartPageTransfer();
  
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
}

